from dataclasses import dataclass


@dataclass(init=False, eq=True, frozen=True)
class TmdbGenre:
    """TMDb のジャンルを扱うデータクラス"""

    genre = {
        "12": "アドベンチャー",
        "14": "ファンタジー",
        "16": "アニメーション",
        "18": "ドラマ",
        "27": "ホラー",
        "28": "アクション",
        "35": "コメディ",
        "36": "ヒストリー",
        "37": "西部劇",
        "53": "スリラー",
        "80": "クライム",
        "99": "ドキュメンタリー",
        "878": "SF",
        "9648": "ミステリー",
        "10402": "音楽",
        "10749": "ロマンス",
        "10751": "ファミリー",
        "10752": "戦争",
        "10770": "テレビ映画",
    }
